# SetSlabPreferencesStyle

## Description
Sets the Slab Style of the Slab Preferences.

```pascal
PROCEDURE SetSlabPreferencesStyle(slabStyle : LONGINT);
```

```python

def vs.SetSlabPreferencesStyle(slabStyle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|slabStyle|LONGINT|The ref number of the Slab Style to apply to the Slab Preferences. 0 for unstyled.|

## See Also
VS Functions:
GetSlabPreferencesStyle

## Version
Availability: from Vectorworks 2011
## Category
* Objects - Architectural